In [57]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [58]:
ser= pd.Series([8,3,6,5,1], index=["b","d","c","a","e",])
print(ser)

b    8
d    3
c    6
a    5
e    1
dtype: int64

In [59]:
# series indexing and slicing 

ser[1:3]

d    3
c    6
dtype: int64

In [60]:
# sorting series by indexing 

ser.sort_index()

a    5
b    8
c    6
d    3
e    1
dtype: int64

In [61]:
# sort series by values

ser.sort_values()

e    1
d    3
a    5
c    6
b    8
dtype: int64

In [62]:
# aggeregataing in series 

ser.mean()

4.6

In [63]:
ser.sum()

23

In [64]:
# create dataframe from series 

df_ser=pd.DataFrame(ser)
df_ser

   0
b  8
d  3
c  6
a  5
e  1

In [65]:
# dataframe manipulation

df=pd.read_csv('C:\\Users\\Administrator\\Downloads\\ny_weather-1.csv')

In [66]:
df.head()

,Date,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,Event
0,1/1/2016,38.0,23.0,52.0,30.03,10.0,8.0,Rain
1,1/2/2016,36.0,18.0,46.0,30.02,10.0,7.0,Sunny
2,1/3/2016,NaN,NaN,47.0,29.86,10.0,8.0,Snow
3,1/6/2016,33.0,NaN,35.0,NaN,10.0,4.0,Rain
4,1/7/2016,39.0,11.0,33.0,30.28,10.0,2.0,Cloudy

In [67]:
df.tail()

,Date,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,Event
9,1/12/2016,35.0,NaN,53.0,29.85,10.0,6.0,NaN
10,1/13/2016,26.0,4.0,NaN,29.94,10.0,10.0,Rain
11,1/14/2016,NaN,12.0,47.0,NaN,NaN,NaN,Rain
12,1/17/2016,36.0,23.0,66.0,29.78,8.0,6.0,Snow
13,1/18/2016,25.0,6.0,53.0,29.83,9.0,NaN,Sunny

In [68]:
df.columns

Index(['Date', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'Event'],
      dtype='object')

In [69]:
# dimension off database

df.ndim

2

In [70]:
# numbers of rows and columns

df.shape

(14, 8)

In [71]:
# slicing and indexing using 
# access elements
# use loc for getting elements from rows index 6 - 11 and columns Temperature ,Humidity, Event 

df.loc[6:11,["Temperature","Humidity","Event"]]

    Temperature  Humidity Event
6          44.0      77.0   NaN
7           NaN       NaN  Snow
8          33.0      37.0   NaN
9          35.0      53.0   NaN
10         26.0       NaN  Rain
11          NaN      47.0  Rain

In [72]:
# use iloc for getting elements from rows index 6 - 11 and columns Temperature ,Humidity, Event 

df.iloc[6:12,[1,3,7]]

    Temperature  Humidity Event
6          44.0      77.0   NaN
7           NaN       NaN  Snow
8          33.0      37.0   NaN
9          35.0      53.0   NaN
10         26.0       NaN  Rain
11          NaN      47.0  Rain

In [73]:
# add columns

values=np.arange(30,44)
values
df["new col"]=values
df.head()

,Date,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,Event,new col
0,1/1/2016,38.0,23.0,52.0,30.03,10.0,8.0,Rain,30
1,1/2/2016,36.0,18.0,46.0,30.02,10.0,7.0,Sunny,31
2,1/3/2016,NaN,NaN,47.0,29.86,10.0,8.0,Snow,32
3,1/6/2016,33.0,NaN,35.0,NaN,10.0,4.0,Rain,33
4,1/7/2016,39.0,11.0,33.0,30.28,10.0,2.0,Cloudy,34

In [76]:
# remove column
df.drop("new col",axis=1,inplace=True)
df

,Date,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,Event
0,1/1/2016,38.0,23.0,52.0,30.03,10.0,8.0,Rain
1,1/2/2016,36.0,18.0,46.0,30.02,10.0,7.0,Sunny
2,1/3/2016,NaN,NaN,47.0,29.86,10.0,8.0,Snow
3,1/6/2016,33.0,NaN,35.0,NaN,10.0,4.0,Rain
4,1/7/2016,39.0,11.0,33.0,30.28,10.0,2.0,Cloudy
5,1/8/2016,39.0,29.0,NaN,30.20,10.0,4.0,Sunny
6,1/9/2016,44.0,38.0,77.0,30.16,NaN,8.0,NaN
7,1/10/2016,NaN,46.0,NaN,NaN,4.0,NaN,Snow
8,1/11/2016,33.0,8.0,37.0,29.92,10.0,NaN,NaN
9,1/12/2016,35.0,NaN,53.0,29.85,10.0,6.0,NaN
10,1/13/2016,26.0,4.0,NaN,29.94,10.0,10.0,Rain
11,1/14/2016,NaN,12.0,47.0,NaN,NaN,NaN,Rain
12,1/17/2016,36.0,23.0,66.0,29.78,8.0,6.0,Snow
13,1/18/2016,25.0,6.0,53.0,29.83,9.0,NaN,Sunny

In [77]:
# add new row
df.loc[14] = ["1/1/2018",39,25,52,34,8,9,"Sunny"]
df

,Date,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,Event
0,1/1/2016,38.0,23.0,52.0,30.03,10.0,8.0,Rain
1,1/2/2016,36.0,18.0,46.0,30.02,10.0,7.0,Sunny
2,1/3/2016,NaN,NaN,47.0,29.86,10.0,8.0,Snow
3,1/6/2016,33.0,NaN,35.0,NaN,10.0,4.0,Rain
4,1/7/2016,39.0,11.0,33.0,30.28,10.0,2.0,Cloudy
5,1/8/2016,39.0,29.0,NaN,30.20,10.0,4.0,Sunny
6,1/9/2016,44.0,38.0,77.0,30.16,NaN,8.0,NaN
7,1/10/2016,NaN,46.0,NaN,NaN,4.0,NaN,Snow
8,1/11/2016,33.0,8.0,37.0,29.92,10.0,NaN,NaN
9,1/12/2016,35.0,NaN,53.0,29.85,10.0,6.0,NaN
10,1/13/2016,26.0,4.0,NaN,29.94,10.0,10.0,Rain
11,1/14/2016,NaN,12.0,47.0,NaN,NaN,NaN,Rain
12,1/17/2016,36.0,23.0,66.0,29.78,8.0,6.0,Snow
13,1/18/2016,25.0,6.0,53.0,29.83,9.0,NaN,Sunny
14,1/1/2018,39.0,25.0,52.0,34.00,8.0,9.0,Sunny

In [ ]:
# remove row at index 8 & 13 

df.drop([8,13],inplace=True)

In [ ]:
#set index as date column

df.set_index("Date",inplace=True)

In [ ]:
# reset index to default

df.reset_index(inplace=True)

In [89]:
#mean values of each column

df.mean(numeric_only=True)

index                    6.000000
Temperature             36.500000
DewPoint                22.900000
Humidity                50.800000
Sea Level PressureIn    30.412000
VisibilityMiles          9.090909
WindSpeedMPH             6.545455
dtype: float64

In [91]:
df

,index,Date,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,Event
0,0,1/1/2016,38.0,23.0,52.0,30.03,10.0,8.0,Rain
1,1,1/2/2016,36.0,18.0,46.0,30.02,10.0,7.0,Sunny
2,2,1/3/2016,NaN,NaN,47.0,29.86,10.0,8.0,Snow
3,3,1/6/2016,33.0,NaN,35.0,NaN,10.0,4.0,Rain
4,4,1/7/2016,39.0,11.0,33.0,30.28,10.0,2.0,Cloudy
5,5,1/8/2016,39.0,29.0,NaN,30.20,10.0,4.0,Sunny
6,6,1/9/2016,44.0,38.0,77.0,30.16,NaN,8.0,NaN
7,7,1/10/2016,NaN,46.0,NaN,NaN,4.0,NaN,Snow
8,8,1/12/2016,35.0,NaN,53.0,29.85,10.0,6.0,NaN
9,9,1/13/2016,26.0,4.0,NaN,29.94,10.0,10.0,Rain
10,10,1/14/2016,NaN,12.0,47.0,NaN,NaN,NaN,Rain
11,11,1/17/2016,36.0,23.0,66.0,29.78,8.0,6.0,Snow
12,12,1/1/2018,39.0,25.0,52.0,34.00,8.0,9.0,Sunny

In [92]:
# Fill missing values with a specified value

df.fillna({"Temperature":36.5,"DewPoint":22.9,"Humidity":50.8,"Sea Level PressureIn":30.4,"VisibilityMiles":9.09,
           "WindSpeedMPH":6.54},inplace=True)

In [93]:
df

,index,Date,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,Event
0,0,1/1/2016,38.0,23.0,52.0,30.03,10.00,8.00,Rain
1,1,1/2/2016,36.0,18.0,46.0,30.02,10.00,7.00,Sunny
2,2,1/3/2016,36.5,22.9,47.0,29.86,10.00,8.00,Snow
3,3,1/6/2016,33.0,22.9,35.0,30.40,10.00,4.00,Rain
4,4,1/7/2016,39.0,11.0,33.0,30.28,10.00,2.00,Cloudy
5,5,1/8/2016,39.0,29.0,50.8,30.20,10.00,4.00,Sunny
6,6,1/9/2016,44.0,38.0,77.0,30.16,9.09,8.00,NaN
7,7,1/10/2016,36.5,46.0,50.8,30.40,4.00,6.54,Snow
8,8,1/12/2016,35.0,22.9,53.0,29.85,10.00,6.00,NaN
9,9,1/13/2016,26.0,4.0,50.8,29.94,10.00,10.00,Rain
10,10,1/14/2016,36.5,12.0,47.0,30.40,9.09,6.54,Rain
11,11,1/17/2016,36.0,23.0,66.0,29.78,8.00,6.00,Snow
12,12,1/1/2018,39.0,25.0,52.0,34.00,8.00,9.00,Sunny

In [94]:
# drop remaining null values
df.dropna(inplace=True)

In [95]:
df

,index,Date,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,Event
0,0,1/1/2016,38.0,23.0,52.0,30.03,10.00,8.00,Rain
1,1,1/2/2016,36.0,18.0,46.0,30.02,10.00,7.00,Sunny
2,2,1/3/2016,36.5,22.9,47.0,29.86,10.00,8.00,Snow
3,3,1/6/2016,33.0,22.9,35.0,30.40,10.00,4.00,Rain
4,4,1/7/2016,39.0,11.0,33.0,30.28,10.00,2.00,Cloudy
5,5,1/8/2016,39.0,29.0,50.8,30.20,10.00,4.00,Sunny
7,7,1/10/2016,36.5,46.0,50.8,30.40,4.00,6.54,Snow
9,9,1/13/2016,26.0,4.0,50.8,29.94,10.00,10.00,Rain
10,10,1/14/2016,36.5,12.0,47.0,30.40,9.09,6.54,Rain
11,11,1/17/2016,36.0,23.0,66.0,29.78,8.00,6.00,Snow
12,12,1/1/2018,39.0,25.0,52.0,34.00,8.00,9.00,Sunny

In [97]:
# group by Event and calculate average temperature

df.groupby("Event")[["Temperature"]].mean()

        Temperature
Event
Cloudy    39.000000
Rain      33.375000
Snow      36.333333
Sunny     38.000000

In [98]:
# Use apply function to convert visiblitymiles into km

df["visiblitykm"]=df["VisibilityMiles"].apply(lambda x: x*1.6)
df

,index,Date,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,Event,visiblitykm
0,0,1/1/2016,38.0,23.0,52.0,30.03,10.00,8.00,Rain,16.000
1,1,1/2/2016,36.0,18.0,46.0,30.02,10.00,7.00,Sunny,16.000
2,2,1/3/2016,36.5,22.9,47.0,29.86,10.00,8.00,Snow,16.000
3,3,1/6/2016,33.0,22.9,35.0,30.40,10.00,4.00,Rain,16.000
4,4,1/7/2016,39.0,11.0,33.0,30.28,10.00,2.00,Cloudy,16.000
5,5,1/8/2016,39.0,29.0,50.8,30.20,10.00,4.00,Sunny,16.000
7,7,1/10/2016,36.5,46.0,50.8,30.40,4.00,6.54,Snow,6.400
9,9,1/13/2016,26.0,4.0,50.8,29.94,10.00,10.00,Rain,16.000
10,10,1/14/2016,36.5,12.0,47.0,30.40,9.09,6.54,Rain,14.544
11,11,1/17/2016,36.0,23.0,66.0,29.78,8.00,6.00,Snow,12.800
12,12,1/1/2018,39.0,25.0,52.0,34.00,8.00,9.00,Sunny,12.800

In [100]:
student=pd.read_csv("e:\students.csv")
student

   id_number               Name  Age Gender
0        204        James Smith   26      M
1        202    Maria Rodriguez   22      F
2        264        David Smith   24      M
3        136    Patricia Garcia   21      F
4        238  Jessica Hernandez   25      F

In [102]:
student.to_csv("e:\students.csv",index=False,header=True)
student

   id_number               Name  Age Gender
0        204        James Smith   26      M
1        202    Maria Rodriguez   22      F
2        264        David Smith   24      M
3        136    Patricia Garcia   21      F
4        238  Jessica Hernandez   25      F

In [103]:
student=pd.read_csv("e:\students.csv")
student

   id_number               Name  Age Gender
0        204        James Smith   26      M
1        202    Maria Rodriguez   22      F
2        264        David Smith   24      M
3        136    Patricia Garcia   21      F
4        238  Jessica Hernandez   25      F

In [104]:
professors=pd.read_csv("e:\professors.csv")

In [109]:
professors.to_csv("e:\professors.csv",index=False,header=True)
professors

         Prof_name  id_number Department
0     Thomas Smith        204        ECE
1  Margaret Garcia        264         EE
2    James Johnson        108        CSE
3   Richard Miller        238         ME
4   Margaret MOORE        136         CE

In [114]:
pd.concat([student,professors],ignore_index=True)

   id_number               Name   Age Gender        Prof_name Department
0        204        James Smith  26.0      M              NaN        NaN
1        202    Maria Rodriguez  22.0      F              NaN        NaN
2        264        David Smith  24.0      M              NaN        NaN
3        136    Patricia Garcia  21.0      F              NaN        NaN
4        238  Jessica Hernandez  25.0      F              NaN        NaN
5        204                NaN   NaN    NaN     Thomas Smith        ECE
6        264                NaN   NaN    NaN  Margaret Garcia         EE
7        108                NaN   NaN    NaN    James Johnson        CSE
8        238                NaN   NaN    NaN   Richard Miller         ME
9        136                NaN   NaN    NaN   Margaret MOORE         CE

In [116]:
pd.merge(student,professors[["id_number","Prof_name"]])

   id_number               Name  Age Gender        Prof_name
0        204        James Smith   26      M     Thomas Smith
1        264        David Smith   24      M  Margaret Garcia
2        136    Patricia Garcia   21      F   Margaret MOORE
3        238  Jessica Hernandez   25      F   Richard Miller

In [118]:
pd.merge(student,professors,how="left")

   id_number               Name  Age Gender        Prof_name Department
0        204        James Smith   26      M     Thomas Smith        ECE
1        202    Maria Rodriguez   22      F              NaN        NaN
2        264        David Smith   24      M  Margaret Garcia         EE
3        136    Patricia Garcia   21      F   Margaret MOORE         CE
4        238  Jessica Hernandez   25      F   Richard Miller         ME

In [119]:
pd.merge(student,professors,how="right")

   id_number               Name   Age Gender        Prof_name Department
0        204        James Smith  26.0      M     Thomas Smith        ECE
1        264        David Smith  24.0      M  Margaret Garcia         EE
2        108                NaN   NaN    NaN    James Johnson        CSE
3        238  Jessica Hernandez  25.0      F   Richard Miller         ME
4        136    Patricia Garcia  21.0      F   Margaret MOORE         CE

In [120]:
pd.merge(student,professors,how="outer")

   id_number               Name   Age Gender        Prof_name Department
0        108                NaN   NaN    NaN    James Johnson        CSE
1        136    Patricia Garcia  21.0      F   Margaret MOORE         CE
2        202    Maria Rodriguez  22.0      F              NaN        NaN
3        204        James Smith  26.0      M     Thomas Smith        ECE
4        238  Jessica Hernandez  25.0      F   Richard Miller         ME
5        264        David Smith  24.0      M  Margaret Garcia         EE